# Кодекс поведения участников (Contributor Covenant)

## Наше обязательство

С целью создания открытой и дружелюбной атмосферы мы, как участники и организаторы проекта, обязуемся сделать участие в жизни нашего сообщества комфортным и безопасным для каждого. Мы гарантируем уважительное отношение ко всем, независимо от возраста, размера тела, инвалидности, этнической принадлежности, гендерной идентичности и её самовыражения, уровня опыта, национальности, внешнего вида, расы, религии, а также сексуальной ориентации и идентичности.

## Наши стандарты

Примеры поведения, которое помогает создавать позитивную атмосферу:

* Уважение к чужому мнению, отличным взглядам и опыту.
* Спокойное и конструктивное восприятие критики.
* Фокус на том, что будет лучшим для всего сообщества.
* Проявление эмпатии к другим участникам комьюнити.

Примеры неприемлемого поведения:

* Использование двусмысленного/сексуализированного языка и изображений, а также нежелательное внимание или знаки внимания сексуального характера.
* Троллинг, оскорбления, унизительные комментарии, переход на личности и политические нападки.
* Преследование и домогательства (как публичные, так и в личных сообщениях).
* Публикация чужих личных данных (например, домашнего адреса или email) без явного и прямого разрешения.
* Любое другое поведение, которое можно обоснованно счесть непрофессиональным в рабочей среде.

## Наша ответственность

Организаторы (модераторы) проекта отвечают за разъяснение стандартов допустимого поведения и обязаны принимать справедливые корректирующие меры в ответ на любые нарушения.

Организаторы имеют право и обязанность удалять, редактировать или отклонять комментарии, коммиты, код, правки в wiki, тикеты (issues) и любой другой вклад, который не соответствует данному Кодексу. Также они имеют право временно или навсегда забанить любого участника за поведение, которое посчитают неуместным, угрожающим, оскорбительным или вредным.

## Границы применения

Данный Кодекс поведения применяется как внутри проектных пространств, так и на публичных площадках, если человек официально представляет проект или его сообщество. Примерами презентации проекта являются: использование официального email-адреса проекта, публикации через официальные аккаунты в соцсетях или участие в качестве назначенного представителя на онлайн- и офлайн-мероприятиях. Границы презентации проекта могут быть дополнительно уточнены и конкретизированы организаторами.


## Указание авторства

Данный Кодекс поведения адаптирован на основе Contributor Covenant версии 1.4 [Contributor Covenant][homepage],
доступна по адресу [http://contributor-covenant.org/version/1/4][version]

[страница]: http://contributor-covenant.org
[версия]: http://contributor-covenant.org/version/1/4/
